In [18]:
import sqlite3
import pandas as pd

# Create a database connection
conn = sqlite3.connect(":memory:")  # Creates a temporary in-memory database
cursor = conn.cursor()

# Check if SQLite is working
cursor.execute("SELECT sqlite_version();")
print("SQLite is working! Version:", cursor.fetchone()[0])

SQLite is working! Version: 3.45.3

In [19]:
# Create employees table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    salary INTEGER,
    department TEXT
);
''')

In [20]:
cursor.executemany('''
INSERT INTO employees (name, salary, department) VALUES (?, ?, ?);
''', [
    ('Alice', 60000, 'HR'),
    ('Bob', 50000, 'IT'),
    ('Charlie', 55000, 'Finance'),
    ('David', 75000, 'IT'),
    ('Eva', 62000, 'HR'),
    ('Frank', 70000, 'Finance'),
    ('Grace', 80000, 'IT')
])
conn.commit()
print("Table created & data inserted successfully!")

Table created & data inserted successfully!

In [21]:
# Create departments table
cursor.execute('''
CREATE TABLE departments (
    department TEXT PRIMARY KEY,
    location TEXT
);
''')

In [22]:
# Insert department data
cursor.executemany('''
INSERT INTO departments (department, location) VALUES (?, ?);
''', [
    ('HR', 'New York'),
    ('IT', 'San Francisco'),
    ('Finance', 'Chicago'),
    ('Marketing', 'Los Angeles')
])

conn.commit()
print("Departments table created & data inserted successfully!")

Departments table created & data inserted successfully!

In [23]:
query = '''
SELECT employees.name, employees.salary, departments.department, departments.location 
FROM employees
INNER JOIN departments ON employees.department = departments.department;
'''
df = pd.read_sql(query,conn)
df

      name  salary department       location
0    Alice   60000         HR       New York
1      Bob   50000         IT  San Francisco
2  Charlie   55000    Finance        Chicago
3    David   75000         IT  San Francisco
4      Eva   62000         HR       New York
5    Frank   70000    Finance        Chicago
6    Grace   80000         IT  San Francisco

In [25]:
query = '''
SELECT * from employees;
'''
df = pd.read_sql(query,conn)
df

   id     name  salary department
0   1    Alice   60000         HR
1   2      Bob   50000         IT
2   3  Charlie   55000    Finance
3   4    David   75000         IT
4   5      Eva   62000         HR
5   6    Frank   70000    Finance
6   7    Grace   80000         IT

In [27]:
query = '''
UPDATE employees SET department = 'HR' WHERE name ='Charlie';
'''
cursor.execute(query)
conn.commit()  # Save changes
print("Record Updated Successfully!")

Record Updated Successfully!

In [28]:
query = '''
DELETE from  employees WHERE name ='Charlie';
'''
cursor.execute(query)
conn.commit()  
print("Record Deleted Successfully!")

Record Deleted Successfully!